// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Cancelar";
"GOBACK_BUTTON"		= "Anterior";
"DIAGNOSE_BUTTON"	= "Diagnóstico";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "A configurar o computador...";
"MESSAGE_PREP_CONNECTION"	= "A preparar para estabelecer ligação...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Erro Desconhecido";
"MESSAGE_FATAL_ERROR_TITLE"		= "Ocorreu um erro inesperado.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Erro";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Erro...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Erro";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Aviso";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Gostaria de continuar?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Não forneceu toda a informação necessária.";
"ERROR_MESSAGE_VALIDATION_0001" = "Verifique os campos assinalados com as setas vermelhas e introduza a informação solicitada.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "O texto introduzido é demasido curto.";
"ERROR_MESSAGE_VALIDATION_0002" = "Verifique o campo destacado e corrija o texto introduzido.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "A informação introduzida não está correcta.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "O nome do utilizador não é válido.";
"ERROR_MESSAGE_VALIDATION_0004" = "Verifique o campo destacado e digite um nome de utilizador válido para a aplicação NetInfo.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "A palavra-passe introduzida não está correcta.";
"ERROR_MESSAGE_VALIDATION_0005" = "Verifique o campo destacado e corrija a palavra-passe.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Não é possível usar o nome especificado.";
"ERROR_MESSAGE_VALIDATION_0006" = "Verifique o campo destacado e escolha um nome diferente.";
"ERROR_MESSAGE_VALIDATION_0007" = "Existe já outro utilizador com este nome abreviado. Especifique um nome diferente.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "O endereço IP introduzido está vazio.";
"ERROR_MESSAGE_VALIDATION_0010" = "O endereço IP introduzido contém caracteres inválidos.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "O endereço deve conter 4 segmentos."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Verifique o campo destacado e especifique um endereço válido. Se desconhece a informação a digitar, contacte o administrador da rede.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "O endereço deve conter 4 segmentos."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Verifique o campo destacado e especifique um endereço válido. Se desconhece a informação a digitar, contacte o administrador da rede.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Cada segmento do endereço deve conter entre 1 e 3 caracteres."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Verifique o campo destacado e especifique um endereço válido. Se desconhece a informação a digitar, contacte o administrador da rede.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "O endereço especificado não é permitido.";
"ERROR_MESSAGE_VALIDATION_0014" = "Verifique o campo destacado e especifique um endereço válido. Se desconhece a informação a digitar, contacte o administrador da rede.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "A máscara de sub-rede especificada não é válida.";
"ERROR_MESSAGE_VALIDATION_0015" = "Verifique o campo destacado e especifique um endereço válido. Se desconhece a informação a digitar, contacte o administrador da rede.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Nome especificado já existente no NetInfo. Não será possível aceder ao NetInfo com este nome.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Não é possível usar o mesmo valor.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "A palavra-passe digitada é inválida.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "O número do cartão de crédito especificado não pode ser usado.";
"ERROR_MESSAGE_VALIDATION_0019" = "Verifique o campo destacado e digite um número de cartão de crédito válido.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "O nome da conta não pode ser iniciado por um número.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Poderá não ser possível utilizar o endereço e-mail especificado.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "O endereço IP e o endereço do router não correspondem à máscara de sub-rede especificada. Verifique os seguintes campos e digite valores válidos:\n     Endereço IP\n     Máscara de Sub-Rede\n     Endereço do Router\nSe desconhece a informação a digitar, contacte o administrador da rede.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Não é possível usar o nome especificado.";
"ERROR_MESSAGE_VALIDATION_0023" = "Verifique o campo destacado e escolha um nome diferente.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Duplicados existentes.";
"ERROR_MESSAGE_VALIDATION_0024" = "Verifique o campo destacado e especifique um valor único.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "O modem não detectou um sinal de marcação.";
"MESSAGE_NO_DIAL_TONE"					= "Certifique-se que o modem se encontra ligado e clique em OK. Ou clique em Cancelar para voltar atrás e seleccionar Ignorar sianl de marcação.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Sair";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "As palavras-passe não são correspondentes.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Verifique os campos assinalados com as setas vermelhas e introduza a mesma palavra-passe em ambos os campos.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Especifique um nome para o local.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Está a criar um novo local da rede no local onde a informação de configuração é guardada. Necessita agora definir o nome para o local.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Especifique um nome diferente.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "Nome já existente. Especifique um nome diferente.";


"MESSAGE_TASK_FORMAT" = "Ligação “%1$@ via %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Sem Fios";
"CONNECTION_Modem" = "Modem";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Modem de cabo";
"CONNECTION_Lan" = "Rede local LAN";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP com ID do Cliente";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "IP estático";

"MESSAGE_TITLE_CONFIGURE" = "A configurar...";
"MESSAGE_FAILED_CONFIGURE" = "A configuração falhou.";
"MESSAGE_DONE_CONFIGURE" = "Termine a configuração.";
"MESSAGE_CHECKING_CONNECTION" = "A alterar a ligação da rede...";
"MESSAGE_CONNECTED" = "Ligação em rede estabelecida.";
"MESSAGE_NOT_CONNECTED" = "Impossível estabelecer uma ligação à rede.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Não foi possível estabelecer uma ligação à rede. Clique em OK para alterar as definições da rede e tente de novo.";

"DEFAULT_LOCATION_NAME" = "Em (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";